NextFOAM-2404/tutorials/verificationAndValidation/atmosphericModels/atmFlatTerrain/successor/setups.orig/common/0.orig/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 1.1;

boundaryField
{
    "p[0-9]+"
    {
        type            freestream;
        freestreamBC
        {
            type        timeVaryingMappedFixedValue;
            offset      0;
            setAverage  off;
            mapMethod   nearest;
            value       $internalField;
        }
        value           $internalField;
    }

    terrain
    {
        type            atmNutkWallFunction;
        Cmu             0.09;
        kappa           0.4;
        z0              uniform 0.05;
        value           uniform 0.0;
    }

    top
    {
        type            slip;
    }
}


// ************************************************************************* //
